Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Lower(Аргумент)
en: Lower(Argument)

source: MD5(Строка)
en: MD5(String)

source: Matthews correlation coefficient (MCC) — коэффициент корреляции Мэтьюса. $$\displaystyle\mathsf{MCC=\frac{TP⋅TN−FP⋅FN}{\sqrt{(TP+FP)(TP+FN)(TN+FP)(TN+FN)}}}$$.
en: Matthews correlation coefficient (MCC) — Matthews correlation coefficient. $$\displaystyle\mathsf{MCC=\frac{TP⋅TN−FP⋅FN}{\sqrt{(TP+FP)(TP+FN)(TN+FP)(TN+FN)}}}$$.

source: Max(Аргумент1, Аргумент2 ...)
en: Max(Argument1, Argument2 ...)

source: Microsoft Edge не ниже 14.0
en: Microsoft Edge14.0 or higher

source: Microsoft SQL – версия 2000 и выше;
en: Microsoft SQL: version 2000 and higher.

source: Min(Аргумент1, Аргумент2 ...)
en: Min(Argument1, Argument2 ...)

source: Minute(ДатаВремя)
en: Minute(DateTime)

source: Mod(Делимое, Делитель)
en: Mod(Dividend, Divisor)

source: Month(Дата)
en: Month(Date)

source: MonthsBetween(Дата1, Дата2)
en: MonthsBetween(Date1, Date2)

source: NOT — операция Логическое "НЕ";
en: NOT: the Logical "NOT" operator;

source: NVL(Выражение , Значение\_по\_умолчанию = "")
en: NVL(Expression , Default\_value = "")

source: Negative predictive value (NPV) — доля верно классифицированных отрицательных примеров от общего числа примеров классифицированных как отрицательные.
en: Negative predictive value (NPV): rate of correctly classified negative cases based on the total number of the cases classified as the negative ones.

source: Null столбец — столбец с пропусками в дискретных гистограммах.
en: Null column: the column with missing values in the discrete histograms.

source: OR — операция Логическое "ИЛИ";
en: OR: the Logical "OR" operator;

source: Opera не ниже 37.0
en: Opera 37.0 or higher

source: Oracle – начиная с версии 9i.
en: Oracle: starting from 9i version.

source: Overall classification rate (OCR) — доля верно классифицированных примеров от общего количества примеров.
en: Overall classification rate (OCR): rate of correctly classified cases based on the total number of cases.

source: Overall precision rate (OPR) — является средним арифметическим между Точностью положительного прогноза и Точностью отрицательного прогноза.
en: Overall precision rate (OPR) means the arithmetical mean of Positive predictive value and Negative predictive value.

source: P-значение модели
en: Model P-value

source: P-значение критерия Вальда
en: P-value of Wald criterion

source: PKhi2(Степени\_свободы, Аргумент)
en: PKhi2(Degrees\_of\_freedom, Argument)

source: POST — при выборе данного метода доступны следующие настройки:
en: POST: when selecting this method, the following settings are available:

source: PR-кривая — зависимость TPR от PPV.
en: PR curve: dependence of TPR on PPV.

source: Port/Shared Memory — порт TCP, используемый сервером СУБД для взаимодействия с клиентом.
en: Port/Shared Memory: the TCP port used by DBMS server to provide interaction with the client.

source: Port — порт TCP, используемый сервером СУБД для взаимодействия с клиентом.
en: Port: the TCP port used by DBMS server to provide interaction with the client.

source: Port — порт TCP, используемый сервером СУБД для взаимодействия с клиентом.Если параметр пустой, то порт по умолчанию 1433.
en: Port: the TCP port used by DBMS server to provide interaction with the client. If the parameter is null, 1433 is used as the default port.

source: PortName — наименование порта;
en: PortName: port name.

source: Positive predictive value (PPV) — доля верно классифицированных положительных примеров от общего числа примеров классифицированных как положительные.
en: Positive predictive value (PPV): rate of correctly classified positive cases based on the total number of the cases classified as the positive ones.

source: Pow(Аргумент, Степень)
en: Pow(Argument, Degree)

source: R1C1 — в формате RxCy, где x — номер строки ячейки, y — номер столбца ячейки.
en: R1C1: in RxCy format where x is a cell row number, y is a cell column number.

source: REST-запрос — REST-запрос.
en: REST request — REST request.

source: REST-сервис
en: REST service

source: RegExDomain(Вх.Строка , Ном.Вхожд = 1)
en: RegExDomain(InputString , OccurenceNumber = 1)

source: RegExEmail(Вх.Строка , Ном.Вхожд = 1)
en: RegExEmail(InputString , OccurenceNumber = 1)

source: RegExMatch(Рег.Выр., Строка)
en: RegExMatch(RegularExpression, String)

source: RegExMatchCount(Рег.Выр., Строка)
en: RegExMatchCount(RegularExpression, String)

source: RegExMatchedExp(Рег.Выр., Строка , НомерЧасти = 1)
en: RegExMatchedExp(RegularExpression, String , PartNumber = 1)

source: RegExMatchedNamedSubExp(Рег.Выр., Строка, ИмяГруппы , НомерЧасти = 1)
en: RegExMatchedNamedSubExp(RegularExpression, String, GroupName , PartNumber = 1)

source: RegExMatchedSubExp(Рег.Выр., Строка, НомерГруппы , НомерЧасти = 1)
en: RegExMatchedSubExp(RegularExpression, String, GroupNumber , PartNumber = 1)

source: RegExReplace(Рег.Выр., Вх.Строка, СтрокаЗамены , НомерЧасти = 1, Расш.Синтаксис = False)
en: RegExReplace(RegularExpression, InputString, ReplaceString , PartNumber = 1, ExtendedSyntax = False)

source: RegExReplaceAll(Рег.Выр., Вх.Строка, СтрокаЗамены , Расш.Синтаксис = False)
en: RegExReplaceAll(RegularExpression, InputString, ReplaceString , ExtendedSyntax = False)

source: RelErr(Аргумент1, Аргумент2)
en: RelErr(Argument1, Argument2)

source: Repeat(Строка, Количество\_повторов)
en: Repeat(String, Count\_of\_repeats)

source: Replace(Строка, Старый\_шаблон, Новый\_шаблон , Заменять\_все, Игнорировать\_регистр)
en: Replace(String, Old\_template, New\_template , Replace\_all, Ignore\_case)

source: Ridge — один из методов понижения размерности.
en: Ridge is one of the methods used for dimension decrease.

source: Right(Строка, Количество\_символов)
en: Right(String, Count\_of\_characters)

source: Round(Аргумент1 , Аргумент2 = 0)
en: Round(Argument1 , Argument2 = 0)

source: SHA1(Строка)
en: SHA1(String)

source: SID — уникальное имя образца БД (System ID).
en: SID: the unique name of the DB example (System ID).

source: SOAP-запрос — SOAP-запрос;
en: SOAP request — SOAP request;

source: SOAP-сервис
en: SOAP service

source: SQL запрос — формирование результирующего набора данных SQL запросом.
en: The SQL query enables to form the resulting data set by means of the SQL query.

source: Safari не ниже 10.3
en: Safari 10.3 or higher

source: Second(ДатаВремя)
en: Second(DateTime)

source: Server — основной компонент платформы.
en: Server is the main platform component.

source: ServerName — хост сервера СУБД, для подключения по протоколу Shared Memory значение хоста должно быть localhost.
en: ServerName: the DBMS server host. The host value must be localhost to connect via the Shared Memory protocol.

source: ServerName — хост сервера СУБД, как указано в конфигурационном файле tnsnames.ora сервера Oracle.
en: ServerName: the DBMS server host as stated in tnsnames.ora configuration file of Oracle server.

source: ServerName — хост сервера СУБД.
en: ServerName: the DBMS server host.

source: ServiceName — псевдоним для одной или нескольких образцов БД.
en: ServiceName: the alias of one or several DB examples.

source: Sign(Аргумент)
en: Sign(Argument)

source: Sin(Угол)
en: Sin(Angle)

source: Space(Количество\_пробелов)
en: Space(Count\_of\_spaces)

source: Sqrt(Аргумент)
en: Sqrt(Argument)

source: StartOfTheWeek(Дата)
en: StartOfTheWeek(Date)

source: StdDev(Аргумент1, Аргумент2 ...)
en: StdDev(Argument1, Argument2 ...)

source: Str(Аргумент)
en: Str(Argument)

source: StrToDate(Аргумент , Формат)
en: StrToDate(Argument , Format)

source: StrZero(Выражение, Общая\_длина)
en: StrZero(Expression, Total\_length)

source: Stuff(Источник, Начало\_позиции, Длина , Вставляемая\_строка = "")
en: Stuff(Source, Start\_position, Length , Inserted_string = "")

source: SubStr(Источник, Начало, Длина)
en: SubStr(Source, Start, Length)

source: Sum(Аргумент1, Аргумент2 ...)
en: Sum(Argument1, Argument2 ...)

source: SumSq(Аргумент1, Аргумент2 ...)
en: SumSq(Argument1, Argument2 ...)

source: T-статистика
en: T-statistics

source: TRUE — Истина.
en: TRUE: the true value.

source: Tan(Угол)
en: Tan(Angle)

source: Tay-b Кендалла — коэффициенты ранговой корреляции Кендалла;
en: Kendall's Tau-b: the Kendall's Tau-b rank correlation coefficient.

source: Trim(Аргумент)
en: Trim(Argument)

source: TrimLeft(Аргумент)
en: TrimLeft(Argument)

source: TrimRight(Аргумент)
en: TrimRight(Argument)

source: True negative (TN) — количество верно классифицированных отрицательных примеров.
en: True negative (TN): the number of correctly classified negative cases.

source: True negative rate (TNR) — доля верно классифицированных отрицательных примеров от общего количества отрицательных примеров.
en: True negative rate (TNR): rate of correctly classified negative cases based on the total number of negative cases.

source: True positive (TP) — количество верно классифицированных положительных примеров.
en: True positive (TP): the number of correctly classified positive cases.

source: True positive rate (TPR) — доля верно классифицированных положительных примеров от общего количества положительных примеров.
en: True positive rate (TPR): rate of correctly classified positive cases based on the total number of positive cases.

source: UNICODE — языконезависимое сравнение символов Unicode без чувствительности к регистру.
en: UNICODE: the language independent Unicode character collation without case sensitivity.

source: URL сервиса — задается адрес отправки запросов к REST-сервису.
en: Service URL: address of request sending to REST service is set.

source: Up — перейти на строку выше;
en: Up: go up to row.

source: Upper(Аргумент)
en: Upper(Argument)

source: Val(Строка)
en: Val(String)

source: VarName — наименование переменной, значение которой необходимо задать в строке запуска.
en: VarName: name of the variable which value must be set in the start string.

source: Week(Дата)
en: Week(Date)

source: WoE (вес доказательства);
en: WoE (weight of evidence);

source: XLS — сохранить текущее представление в формате Excel.
en: XLS: save the current view in the Excel format.

source: XML-файл
en: XML file

source: XOR — операция Логическое "исключающее ИЛИ".
en: XOR: the Logical "exclusive OR" operator.

source: XSD файл — поле для выбора *.xsd-файла (не редактируемое).
en: XSD file: the field for selection of the *.xsd file (not edited).

source: XSD файл — поле для выбора файла (не редактируемое).
en: XSD file: the field for the file selection (not edited).

source: Year(Дата)
en: Year(Date)

source: YearsBetween(Дата1, Дата2)
en: YearsBetween(Date1, Date2)

source: ^1: Межквартильный размах — разница между верхним и нижним квартилями; ^2: Размах — разница между максимальным и минимальным значениями; ^3: Значения — количество непустых элементов в поле.
en: ^1: Interquartile range: difference between the upper and lower quartiles. ^2: Range: difference between the maximum and minimum values. ^3: Values: number of not null items in the field.

source: ^1: Доступно только для редакций с возможностью публикации Веб-сервисов.
en: ^1: It is available only for the editions with possibility to publish Web Services.

source: ^1: добавленный ранее вычисляемый факт можно редактировать или удалить в окне Настройки фактов.
en: ^1: earlier added calculated measure can be edited or deleted in Settings of measures window.

source: cmd.exe /C %ИмяПеременной%
en: cmd.exe /C %VariableName%

source: cmd.exe — указывается название программы и ее расширение.
en: cmd.exe: the program name and its extension are specified.

source: d — день месяца без ведущего нуля.
en: d — day of the month without leading zero.

source: dd — день месяца в виде 2-х цифр.
en: dd — day of the month in the form of 2 digits.

source: ddd — день недели в сокращенном формате ("Воск", "Пн" и т.д.).
en: ddd — day of the week in the abbreviated format ("Sun", "Mon", etc).

source: dddd — день недели в полном формате ("Воскресенье", "Понедельник" и т.д.).
en: dddd — day of the week in the full format ("Sunday", "Monday", etc).

source: false — Ложь;
en: false — False.

source: h — часы без ведущего нуля.
en: h — hours without leading zero.

source: hh — часы в виде 2-х цифр.
en: hh — hours in the form of 2 digits.

source: http://<Server>/<App>/service.svc/rest/help, где <Server> — хост Loginom Integrator, <App> — имя приложения Loginom Integrator в IIS (задается при инсталляции Loginom Integrator, при установке по умолчанию <App> = lgi).
en: http://<Server>/<App>/service.svc/rest/help where <Server>: the Loginom Integrator host, <App> is a name of the Loginom Integrator application in IIS (it is set when installing Loginom Integrator, when setting by default <App> = lgi).

source: http://<Server>/<App>/service.svc?wsdl, где <Server> — хост Loginom Integrator, <App> — имя приложения Loginom Integrator в IIS (задается при инсталляции Loginom Integrator, при установке по умолчанию <App> = lgi).
en: http://<Server>/<App>/service.svc?wsdl where <Server>: the Loginom Integrator host, <App> is a name of the Loginom Integrator application in IIS (it is set when installing Loginom Integrator, when setting by default <App> = lgi).

source: lower, upper для UNICODE — флаг расширяет действия функций lower, upper на все символы UNICODE.
en: lower, upper for UNICODE: the checkbox extends the effect of lower, upper functions for all UNICODE characters.

source: m — номер месяца без ведущего нуля.
en: m — number of the month without leading zero.

source: mm — номер месяца в виде 2-х цифр.
en: mm — number of the month in the form of 2 digits.

source: mmm — месяц в сокращенном формате ("Янв", "Фев" и т.д.).
en: mmm — month in the abbreviated format ("Jan", "Feb", etc).

source: mmmm — месяц в полном формате ("Январь", "Февраль" и т.д.).
en: mmmm — month in the full format ("January", "February", etc).

source: n — минуты без ведущего нуля.
en: n — minutes without leading zero.

source: nn — минуты в виде 2-х цифр.
en: nn — minutes in the form of 2 digits.

source: s — секунды без ведущего нуля.
en: s — seconds without leading zero.

source: ss — секунды в виде 2-х цифр.
en: ss — seconds in the form of 2 digits.

source: true — Истина.
en: true — True.

source: wh-firebird Подключение к Deductor Warehouse Firebird
en: wh-firebird Connection to Deductor Warehouse Firebird

source: wh-mssql Подключение к Deductor Warehouse MS SQL
en: wh-mssql Connection to Deductor Warehouse MS SQL

source: wh-oracle Подключение к Deductor Warehouse Oracle
en: wh-oracle Connection to Deductor Warehouse Oracle

source: y или yy — год, 2 цифры.
en: y or yy — year, 2 digits.

source: yyyy — год, 4 цифры.
en: yyyy — year, 4 digits.

source: z — миллисекунды без ведущего нуля.
en: z — mlliseconds without leading zero.

source: zzz — миллисекунды в виде 2-х цифр.
en: zzz — mlliseconds in the form of 2 digits.

source: || — Логическое "ИЛИ";
en: || — Logical "OR".

source: АКФ — коэффициенты автокорреляции для каждого лага;
en: ACF: autocorrelation coefficients for each lag.

source: Абсолютное масштабирование — каждое значение делится на максимальное абсолютное значение.
en: Absolute scaling: each value is divided by the maximum absolute value.

source: Абсолютные частоты Абсолютные частоты — столбцы отражают реальное количество значений.
en: Absolute frequencies Absolute frequencies: the columns display the real number of values.

source: Абсолютный (для совместного использования) — включает в себя имя папки, из которой загружен файл.
en: Absolute (for joint usage) includes a name of the folder from which a file was downloaded.

source: Автоматическая синхронизация полей
en: Automapping of fields

source: Автоматически — в режиме пакетной обработки.
en: Auto: in thebatch processing mode.

source: Автоматически — установленная галочка в этом поле обеспечивает автоматическую настройку параметров квантования выбранного метода.
en: Auto: the checkbox selected in this field secures auto setup of binning parameters for the selected method.

source: Авторизация та же, что и для получения WSDL — при выставлении флажка использует тех же параметры авторизации, что и при получении WSDL.
en: Authorization is the same as for WSDL: when this checkbox is selected, the same authorization parameters are used as for WSDL.

source: Агрегация — содержит список методов агрегации, применимых к полям таблиц.
en: Aggregation contains a list of the aggregation methods applied to the table fields.

source: Администрирование
en: Administration

source: Администрирование Администрирование
en: Administration Administration

source: Администрирование;
en: Administration

source: Адресная строка.
en: Address bar.

source: Адресная строка
en: Address bar

source: Адресная строка — строка, содержащая путь к открытому объекту;
en: Address bar: the line that contains a path to the opened object.

source: Активация и просмотр — клик по данной кнопке позволяет сразу в мастере настройки увидеть, как будет выглядеть экспортируемая таблица.
en: Activate and Show: clicking on this button shows in the wizard how the exported table will look like.

source: Активация и просмотр — клик по данной кнопке позволяет сразу в мастере настройки увидеть, как именно будет выглядеть таблица в Excel, и, если необходимо, изменить какие-либо параметры.
en: Activate and Show: clicking on this button shows in the wizard how the table in Excel will look like, and to change any parameters if it is required.

source: Активировать — позволяет установить связь с Хранилищем данных, если это еще не было сделано.
en: Activate provides connection with the Data Warehouse if it has not been established yet.

source: Алгоритм автоподбора
en: Auto Selection Algorithm

source: Алгоритм выбора режима активации.
en: Algorithm of the Activation Mode Selection.

source: Алгоритм сжатия может применяться для уменьшения размера файла экспорта.
en: Compression can be applied to decrease the export file size.

source: Алгоритм сжатия — отображение информации о методе сжатия LGD-файла, использованном при его создании.
en: Compression enables to display information on the LGD file compression method used for its creation.

source: Аномальные значения
en: Anomalous values.

source: Атрибут Атрибут.
en: Attribute Attribute.

source: Атрибут — это свойство измерения, помогающее пользователю полнее описать исследуемое измерение.
en: Attribute means the dimension property that helps a user to describe the dimension under research better.

source: Аутентификация этого пользователя с полным доменным именем (DN) из найденной учетной записи и введенным паролем.
en: Authentification of this user with full domain name (DN) from the detected account and entered password.

source: База данных
en: Database

source: База данных — имя базы, содержащей необходимые данные.
en: Database: the name of the database that includes the required data.

source: База данных — наименование БД.
en: Database: DB name.

source: База данных — отображает строку подключения к базе данных.
en: Database enables to display a string of connection to database.

source: База данных — путь к файлу базы данных.
en: Database: path to the database file.

source: Базовый узел — узел или Подмодель, настройки и алгоритм которого предполагается использовать повторно, может находиться за пределами текущей Подмодели, Сценария, Модуля или Пакета.
en: Base node: the node or Supernode, settings and algorithm of which are to be used repeatedly. It can be located outside the current Supernode, Workflow, Module or Package.

source: Без вращения — исходные факторы, полученные методом главных компонент, остаются без изменений.
en: No rotation: the source factors received by the main components methods remain unchanged.

source: Бесконечность — в этом случае узел будет выполняться до тех пор, пока программа не будет закрыта.
en: Infinity: in this case the node will be executed until the program is closed.

source: Быстрый просмотр
en: Quick view

source: В конце набора — в качестве тестовой выборки будут использованы строки из конца набора, взятые в том же порядке, что и в исходной таблице.
en: End of set: the set end rows taken in the same order as in the source table will be used as the test sample.

source: В начале набора — в качестве тестовой выборки будут использованы строки из начала набора, взятые в том же порядке, что и в исходной таблице;
en: Start of set: the set start rows taken in the same order as in the source table will be used as the test sample.

source: В столбцах В столбцах — построение серии диаграммы по данным столбца.
en: In columns In columns: construction of the chart series according to the column data.

source: В столбце — следующее найденное значение будет подсвечено в выбранном столбце.
en: In column: the next found value will be highlighted in the selected column.

source: В строках В строках — построение серии диаграммы по данным строки.
en: In rows In rows: construction of the chart series according to the row data.

source: В файловом хранилище или локальной сети — подключение к базе данных через указание ее каталога на жестком диске.
en: In file storage or local network: connection to the database by specifying its directory on the hard disk.

source: ВАЖНО: при написании сложных условий приоритет будет у оператора И.
en: IMPORTANT: When writing complex criteria, AND operator will be prioritised.

source: Важно: В случае использования метода квантования "Плитка" с типом обработки совпадающих наблюдений "Оставить как есть", в столбцах Квота нижней границы, Квота верхней границы и Квота интервала будет выводиться информация о количестве значений, попавших в данный интервал.
en: Important: If the "Tile" binning method is used with the Ties processing type "Leave as is", information on the number of the values included into this bin will be shown in Lower bound quota, Upper bound quota and Bin quota columns.

source: Важно: В таблицах семейства MergeTree операции мутации данных не атомарны (подробнее см.
en: Important: Data mutation operations are not atomic in the MergeTree tables (for more details, see

source: Важно: Для обмена данными с сервером используется кодировка UTF-8.
en: Important: UTF-8 encoding is used for data exchange with the server.

source: Важно: Для обмена данными с сервером используется кодировка UTF16.
en: Important: UTF16 encoding is used for data exchange with the server.

source: Важно: Для организации подключений к некоторыми источниками, например, к некоторым базам данных, необходимо наличие установленного клиента этой СУБД, либо клиентских библиотек той же разрядности, что и разрядность приложения/сервера Loginom.
en: Important: To provide connections to some sources, for example, to some databases, it is required to install the client of this DBMS or the client libraries with the same bitness as the Loginom application/server bitness.

source: Важно: Для работы узла требуется предварительно создать Подключение к Хранилищу данных и связать его с входным портом Подключение.
en: Important: For the node operation, it is required to pre-create Connection to the Data Warehouse and connect it with the Connection input port.

source: Важно: Для работы узла требуется предварительно создать подключение к XSD-схеме и связать его с входным портом Подключение.
en: Important: For the node operation, it is required to pre-create connection to the XSD schema and connect it with the Connection input port.

source: Важно: Для работы узла требуется предварительно создать подключение к платформе 1C:Предприятие 8.x и связать его с входным портом Подключение.
en: Important: For the node operation, it is required to pre-create connection to 1C:Enterprise 8.x platform and connect it with the Connection input port.
